{
  "common": {
    "name": "tankerkoenig",
    "version": "3.3.2",
    "news": {
      "3.3.2": {
        "en": "Fixed TypeError: Cannot read property 'length' of undefined in addDiscount if value is `boolean / undefined`.\nFixed error: DB closed when adapter is stopped \nObject creation optimized\nchanged query interval default value to 10 minutes and minimum value to 10 minutes\nadded check if station ID is already configured (in edit mode)\nAdded price difference to last price\nadded feature request cheapest station display [Issue #109]",
        "de": "TypeError behoben: Cannot read property 'length' of undefined in addDiscount if value is `boolean / undefined`.\nFehler behoben: DB closed , wenn Adapter gestoppt wird \nObjekterzeugung optimiert\nAbfrageintervall Standardwert auf 10 Minuten und Mindestwert auf 10 Minuten geändert\nPrüfung hinzugefügt, ob die Stations-ID bereits konfiguriert ist (im Bearbeitungsmodus)\nPreisdifferenz zum letzten Preis hinzugefügt\nFeature-Request für billigste Stationsanzeige hinzugefügt [Issue #109]",
        "ru": "Исправлена ошибка TypeError: Невозможно прочитать свойство 'length' из undefined в addDiscount, если значение `boolean / undefined`.\nИсправлена ошибка: БД закрывалась при остановке адаптера \nОптимизировано создание объектов\nизменено значение интервала запроса по умолчанию на 10 минут и минимальное значение на 10 минут\nдобавлена проверка, если ID станции уже настроен (в режиме редактирования)\nдобавлена разница цен с последней ценой\nдобавлен запрос на отображение самой дешевой станции [Выпуск #109]",
        "pt": "TypeError fixo: Não é possível ler a propriedade \"comprimento\" de indefinido no addDiscount se o valor for \"booleano / indefinido\".\nErro corrigido: DB fechado quando o adaptador é parado \nCriação de objectos optimizada\nalterou o valor por defeito do intervalo de consulta para 10 minutos e o valor mínimo para 10 minutos\nadicionado verificar se o ID da estação já está configurado (em modo de edição)\nAcrescentar diferença de preço ao último preço\npedido de recurso adicional exibição da estação mais barata [Edição #109]",
        "nl": "Fixed TypeError: Kan eigenschap 'lengte' van undefined in addDiscount niet lezen als waarde `boolean / undefined` is.\nVaste fout: DB gesloten wanneer adapter wordt gestopt \nObject creatie geoptimaliseerd\nquery-interval standaardwaarde gewijzigd in 10 minuten en minimumwaarde in 10 minuten\ncontrole toegevoegd of station ID al is geconfigureerd (in bewerkmodus)\nPrijsverschil toegevoegd aan laatste prijs\nfeature request goedkoopste stationweergave toegevoegd [Issue #109]",
        "fr": "Correction de TypeError : Impossible de lire la propriété 'length' d'undefined dans addDiscount si la valeur est `boolean / undefined`.\nCorrection d'une erreur : DB fermée lorsque l'adaptateur est arrêté \nCréation d'objets optimisée\nLa valeur par défaut de l'intervalle de requête a été modifiée en 10 minutes et la valeur minimale en 10 minutes.\nAjout d'une vérification si l'ID de la station est déjà configuré (en mode édition)\nAjout de la différence de prix au dernier prix\nAjout d'une demande de fonctionnalité pour l'affichage de la station la moins chère [Issue #109].",
        "it": "Errore di tipo corretto: Impossibile leggere la proprietà 'length' di undefined in addDiscount se il valore è `boolean / undefined`.\nErrore corretto: DB chiuso quando l'adattatore viene fermato \nCreazione di oggetti ottimizzata\nmodificato il valore predefinito dell'intervallo di query a 10 minuti e il valore minimo a 10 minuti\naggiunto controllo se l'ID della stazione è già configurato (in modalità di modifica)\nAggiunta la differenza di prezzo all'ultimo prezzo\naggiunta richiesta di funzionalità per la visualizzazione delle stazioni più economiche [Issue #109].",
        "es": "Corregido TypeError: No se puede leer la propiedad 'length' de undefined en addDiscount si el valor es `boolean / undefined`.\nCorregido error: BD cerrada cuando se detiene el adaptador \nCreación de objetos optimizada\ncambiado el valor por defecto del intervalo de consulta a 10 minutos y el valor mínimo a 10 minutos\nañadida comprobación si el ID de estación ya está configurado (en modo edición)\nAñadida diferencia de precio al último precio\nAñadida solicitud de función de visualización de estación más barata [incidencia nº 109].",
        "pl": "Naprawiono TypeError: Cannot read property 'length' of undefined in addDiscount if value is `boolean / undefined`.\nNaprawiony błąd: DB zamknięty, gdy adapter jest zatrzymany \nZoptymalizowano tworzenie obiektów\nZmieniono wartość domyślną interwału zapytania na 10 minut oraz wartość minimalną na 10 minut\ndodano sprawdzanie czy ID stacji jest już skonfigurowane (w trybie edycji)\nDodano różnicę w cenie do ostatniej ceny\ndodano feature request najtańsze wyświetlanie stacji [Issue #109]",
        "uk": "Виправлено TypeError: Неможливо прочитати властивість 'length' з undefined в addDiscount, якщо значення `boolean / undefined`.\nВиправлена помилка: БД закривалася при зупинці адаптера \nОптимізовано створення об'єктів\nзмінено значення інтервалу запиту за замовчуванням на 10 хвилин та мінімальне значення на 10 хвилин\nдодана перевірка, чи вже налаштований ID станції (в режимі редагування)\nдодана різниця в ціні до останньої ціни\nдодана функція запиту відображення найдешевшої станції [Випуск #109].",
        "zh-cn": "修正了TypeError。如果值是 \"boolean / undefined\"，不能读取addDiscount中未定义的属性 \"length\"。\n修正了错误。当适配器停止时，数据库被关闭 \n优化了对象创建\n更改了查询间隔的默认值为10分钟，最小值为10分钟\n增加了车站ID是否已经配置的检查（在编辑模式）。\n为最后的价格增加了价格差异\n增加了最便宜的车站显示功能请求 [问题#109] 。"
      },
      "3.3.1": {
        "en": "Fixed TypeError: Cannot read properties of undefined Issue #104\nadded complete street datapoint for each station",
        "de": "TypeError behoben: Cannot read properties of undefined Ausgabe #104\nDatenpunkt für komplette Straße für jede Station hinzugefügt",
        "ru": "Исправлена ошибка TypeError: Невозможно прочитать свойства неопределенного Выдача #104\nдобавлена точка данных полной улицы для каждой станции",
        "pt": "TypeError fixo: Não é possível ler as propriedades da edição não definida #104\nadicionado um datapoint completo de rua para cada estação",
        "nl": "Fixed TypeError: Kan geen eigenschappen lezen van ongedefinieerde Issue #104\ncompleet straat datapunt toegevoegd voor elk station",
        "fr": "Correction de TypeError : Impossible de lire les propriétés d'undefined Issue #104\najout d'un point de données sur les rues complètes pour chaque station",
        "it": "TypeError corretto: Impossibile leggere le proprietà di undefined Problema #104\naggiunto il dato della strada completa per ogni stazione",
        "es": "Corregido TypeError: Cannot read properties of undefined Edición nº 104\nañadido un punto de datos de calle completa para cada estación",
        "pl": "Naprawiono TypeError: Cannot read properties of undefined Issue #104\ndodano dane dotyczące kompletnych ulic dla każdej stacji",
        "uk": "Виправлено TypeError: Cannot read properties of undefined Issue #104\nдодано повну вулицю для кожної станції",
        "zh-cn": "修正了TypeError。无法读取未定义的属性 问题#104\n为每个车站添加完整的街道数据点"
      },
      "3.3.0": {
        "en": "Added Sentry for crash reporting\nAdded detailed request when creating stations in the UI",
        "de": "Sentry zur Meldung von Abstürzen hinzugefügt\nDetaillierte Anfrage beim Erstellen von Stationen in der UI hinzugefügt",
        "ru": "Добавлена функция Sentry для сообщения об авариях\nДобавлен детальный запрос при создании станций в пользовательском интерфейсе",
        "pt": "Adicionado Sentinela para relatórios de crash\nAdicionado pedido detalhado ao criar estações na UI",
        "nl": "Sentry voor crashmelding toegevoegd\nGedetailleerd verzoek toegevoegd bij het aanmaken van stations in de UI",
        "fr": "Ajout de Sentry pour le rapport de crash\nAjout d'une demande détaillée lors de la création de stations dans l'interface utilisateur",
        "it": "Aggiunta la funzione Sentry per la segnalazione degli incidenti\nAggiunta richiesta dettagliata durante la creazione di stazioni nell'interfaccia utente",
        "es": "Añadido Sentry para la notificación de fallos\nAñadida solicitud detallada al crear estaciones en la interfaz de usuario",
        "pl": "Dodano Sentry do raportowania o awariach\nDodano szczegółowe zapytanie podczas tworzenia stacji w UI",
        "uk": "Додано Sentry для повідомлення про аварії\nДодано детальний запит при створенні станцій в інтерфейсі користувача",
        "zh-cn": "增加了用于崩溃报告的哨兵\n在用户界面中创建站点时增加了详细请求"
      },
      "3.2.5": {
        "en": "Problem with entering the postal code in the UI fixed",
        "de": "Problem bei der Eingabe der Postleitzahl in der Benutzeroberfläche behoben",
        "ru": "Исправлена проблема с вводом почтового индекса в пользовательском интерфейсе",
        "pt": "Problema com a introdução do código postal na IU corrigido",
        "nl": "Probleem met het invoeren van de postcode in de UI opgelost",
        "fr": "Correction du problème de saisie du code postal dans l'interface utilisateur",
        "it": "Problema con l'inserimento del codice postale nell'interfaccia utente risolto",
        "es": "Solucionado el problema con la introducción del código postal en la interfaz de usuario",
        "pl": "Naprawiono problem z wpisywaniem kodu pocztowego w UI",
        "uk": "Виправлено проблему з введенням поштового індексу в інтерфейсі",
        "zh-cn": "在用户界面中输入邮政编码的问题得到解决"
      },
      "3.2.4": {
        "en": "Problem with setting objects => type \"Number\" set, but type \"String\" obtained [Problem #100] fixed.",
        "de": "Problem beim Setzen von Objekten => Typ \"Zahl\" gesetzt, aber Typ \"String\" erhalten [Problem #100] behoben.",
        "ru": "Проблема с установкой объектов => тип \"Число\" установлен, но получен тип \"Строка\" [Проблема #100] исправлена.",
        "pt": "Problema com a definição de objectos => tipo \"Number\" definido, mas tipo \"String\" obtido [Problema #100] corrigido.",
        "nl": "Probleem met het instellen van objecten => type \"Getal\" ingesteld, maar type \"String\" verkregen [Probleem #100] opgelost.",
        "fr": "Problème de paramétrage des objets => type \"Number\" défini, mais type \"String\" obtenu [Problème #100] corrigé.",
        "it": "Problema di impostazione degli oggetti => tipo \"Numero\" impostato, ma tipo \"Stringa\" ottenuto [Problema #100] risolto.",
        "es": "Problema con la configuración de objetos => tipo \"Número\" establecido, pero tipo \"Cadena\" obtenido [Problema #100] solucionado.",
        "pl": "Problem z ustawianiem obiektów => typ \"Number\" ustawiony, ale typ \"String\" uzyskany [Problem #100] naprawiony.",
        "uk": "Виправлено проблему із встановленням об'єктів => тип \"Число\" встановлено, але отримано тип \"Рядок\" [Проблема #100].",
        "zh-cn": "设置对象的问题=>设置了 \"Number \"类型，但获得了 \"String \"类型[问题#100]修复。"
      },
      "3.2.3": {
        "en": "the detailed request for the station data has been removed, see [issue #99]\nadded new input field for the address of the station in the adapter settings",
        "de": "die detaillierte Abfrage der Stationsdaten wurde entfernt, siehe [issue #99]\nneues Eingabefeld für die Adresse der Station in den Adaptereinstellungen hinzugefügt",
        "ru": "убран подробный запрос данных о станции, см. [выпуск #99].\nдобавлено новое поле для ввода адреса станции в настройках адаптера",
        "pt": "o pedido pormenorizado dos dados da estação foi retirado, ver [edição nº 99]\nadicionado novo campo de entrada para o endereço da estação nas definições do adaptador",
        "nl": "het gedetailleerde verzoek om de stationsgegevens is verwijderd, zie [issue #99]\nnieuw invoerveld toegevoegd voor het adres van het station in de adapterinstellingen",
        "fr": "la demande détaillée des données de la station a été supprimée, voir [issue #99].\nAjout d'un nouveau champ de saisie pour l'adresse de la station dans les paramètres de l'adaptateur.",
        "it": "la richiesta dettagliata dei dati della stazione è stata rimossa, vedi [issue #99].\naggiunto un nuovo campo di inserimento per l'indirizzo della stazione nelle impostazioni dell'adattatore",
        "es": "se ha eliminado la solicitud detallada de los datos de la estación, véase [cuestión nº 99]\nse ha añadido un nuevo campo de entrada para la dirección de la estación en los ajustes del adaptador",
        "pl": "usunięto szczegółowe zapytanie o dane stacji, patrz [issue #99]\ndodano nowe pole wprowadzania adresu stacji w ustawieniach adaptera",
        "uk": "прибрано детальний запит даних станції, див. [випуск #99]\nдодано нове поле для введення адреси станції у налаштуваннях адаптера",
        "zh-cn": "删除了对站点数据的详细要求，见[issue #99]。\n在适配器设置中增加了新的站点地址输入字段"
      },
      "3.2.2": {
        "en": "Added encryption of the API key\nadded better error messages for the data request\ndependency update",
        "de": "Verschlüsselung des API-Schlüssels hinzugefügt\nBessere Fehlermeldungen für die Datenabfrage hinzugefügt\nAktualisierung der Abhängigkeiten",
        "ru": "Добавлено шифрование ключа API\nдобавлены улучшенные сообщения об ошибках при запросе данных\nобновление зависимостей",
        "pt": "Acrescentada a encriptação da chave API\nacrescentou melhores mensagens de erro para o pedido de dados\nactualização de dependência",
        "nl": "encryptie van de API-sleutel toegevoegd\nbetere foutmeldingen toegevoegd voor de gegevensaanvraag\nafhankelijkheid bijgewerkt",
        "fr": "Ajout du cryptage de la clé API\najout de meilleurs messages d'erreur pour la demande de données\nmise à jour des dépendances",
        "it": "Aggiunta della crittografia della chiave API\naggiunti migliori messaggi di errore per la richiesta di dati\naggiornamento delle dipendenze",
        "es": "añadido el cifrado de la clave API\nañadido mejores mensajes de error para la solicitud de datos\nactualización de la dependencia",
        "pl": "Dodano szyfrowanie klucza API\ndodano lepsze komunikaty o błędach dla żądania danych\naktualizacja zależności",
        "uk": "Додано шифрування ключа API\nдодані покращені повідомлення про помилки для запиту даних\nоновлення залежностей",
        "zh-cn": "增加了API密钥的加密功能\n为数据请求添加了更好的错误信息\n依赖性更新"
      }
    },
    "titleLang": {
      "en": "Tankerkoenig Fuel prices",
      "de": "Tankerkönig Spritpreise",
      "ru": "Tankerkoenig Цены на топливо",
      "pt": "Preços de combustível Tankerkoenig",
      "nl": "Tankerkoenig Brandstofprijzen",
      "fr": "Prix du carburant Tankerkoenig",
      "it": "Prezzi del carburante Tankerkoenig",
      "es": "Precios del combustible Tankerkoenig",
      "pl": "Tankerkoenig Ceny paliwa",
      "uk": "Tankerkoenig Ціни на паливо",
      "zh-cn": "Tankerkoenig燃料价格"
    },
    "desc": {
      "en": "Tankerkoenig fuel prices",
      "de": "Tankerkönig Spritpreise",
      "ru": "Tankerkoenig Цены на топливо",
      "pt": "Preços de combustível Tankerkoenig",
      "nl": "Tankerkoenig Brandstofprijzen",
      "fr": "Prix du carburant Tankerkoenig",
      "it": "Prezzi del carburante Tankerkoenig",
      "es": "Precios del combustible Tankerkoenig",
      "pl": "Tankerkoenig Ceny paliwa",
      "uk": "Tankerkoenig Ціни на паливо",
      "zh-cn": "Tankerkoenig燃料价格"
    },
    "authors": [
      {
        "name": "pix"
      },
      {
        "name": "xXBJXx",
        "email": "issi.dev.iobroker@gmail.com"
      }
    ],
    "docs": {
      "en": "docs/en/doc_tankerkoenig_en.md",
      "de": "docs/de/doc_tankerkoenig_de.md"
    },
    "keywords": [
      "fuel",
      "gas",
      "tankerkoenig",
      "Tankerkönig",
      "Sprit",
      "Spritpreis",
      "Tankstelle",
      "Diesel",
      "Benzin"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "tankerkoenig.png",
    "enabled": false,
    "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.tankerkoenig/master/admin/tankerkoenig.png",
    "readme": "https://github.com/iobroker-community-adapters/ioBroker.tankerkoenig/blob/master/README.md",
    "allowInit": true,
    "loglevel": "info",
    "mode": "daemon",
    "type": "vehicle",
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "stopBeforeUpdate": true,
    "eraseOnUpload": true,
    "materialize": true,
    "messagebox": true,
    "dependencies": [
      {
        "js-controller": ">=3.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.3.3"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://a9e6413d06b64e7e8e8fb892dfd7532e@sentry.iobroker.net/228"
      }
    },
    "tier": 3,
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.0.0",
            "newVersion>=3.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "uk": "Важлива замітка!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "The adapter has been reprogrammed from scratch, which means the old config is no longer compatible with the new version. The stations must all be created again.",
          "de": "Der Adapter wurde von Grund auf neu programmiert, was bedeutet, dass die alte Konfiguration nicht mehr mit der neuen Version kompatibel ist. Die Stationen müssen alle neu erstellt werden.",
          "ru": "Адаптер был перепрограммирован с нуля, а значит, старый конфиг больше не совместим с новой версией. Все станции должны быть созданы заново.",
          "pt": "O adaptador foi reprogramado do zero, o que significa que a configuração antiga já não é compatível com a nova versão. As estações devem ser todas criadas novamente.",
          "nl": "De adapter is helemaal opnieuw geprogrammeerd, waardoor de oude config niet meer compatibel is met de nieuwe versie. De stations moeten allemaal opnieuw worden aangemaakt.",
          "fr": "L'adaptateur a été reprogrammé à partir de zéro, ce qui signifie que l'ancienne configuration n'est plus compatible avec la nouvelle version. Les stations doivent toutes être créées à nouveau.",
          "it": "L'adattatore è stato riprogrammato da zero, il che significa che la vecchia configurazione non è più compatibile con la nuova versione. Le stazioni devono essere create di nuovo.",
          "es": "El adaptador ha sido reprogramado desde cero, lo que significa que la antigua configuración ya no es compatible con la nueva versión. Hay que volver a crear todas las estaciones.",
          "pl": "Adapter został przeprogramowany od nowa, co oznacza, że stara konfiguracja nie jest już kompatybilna z nową wersją. Wszystkie stacje muszą być utworzone od nowa.",
          "uk": "Адаптер було перепрограмовано з нуля, а це означає, що стара конфігурація більше не сумісна з новою версією. Всі станції повинні бути створені заново.",
          "zh-cn": "适配器已经从头开始重新编程，这意味着旧的配置不再与新版本兼容。这些站必须全部重新创建。"
        },
        "link": "https://forum.iobroker.net/topic/60140/tankerk%C3%B6nig-adapter-komplett-umbau",
        "linkText": {
          "en": "please read forum post before update",
          "de": "Bitte lese den Forenbeitrag vor dem Update",
          "ru": "пожалуйста, прочитайте сообщение на форуме перед обновлением",
          "pt": "por favor lê a mensagem do fórum antes de actualizares",
          "nl": "lees a.u.b. de forumpost vóór de update",
          "fr": "S'il te plaît, lis le post du forum avant la mise à jour",
          "it": "Leggi il post del forum prima di aggiornare",
          "es": "por favor, lee el post del foro antes de actualizar",
          "pl": "przeczytaj post na forum przed aktualizacją",
          "uk": "будь ласка, прочитайте повідомлення на форумі перед оновленням",
          "zh-cn": "更新前请阅读论坛帖子"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ],
    "adminUI": {
      "config": "materialize"
    }
  },
  "protectedNative": [
    "apikey"
  ],
  "native": {
    "synctime": 5,
    "resetValues": false,
    "apikey": "",
    "station": [],
    "combinedOptions": {
      "closed": "Station Closed",
      "noPrice": "No Prices",
      "notFound": "Station Not Found"
    }
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "stations",
      "type": "channel",
      "common": {
        "name": "Gas stations"
      },
      "native": {}
    },
    {
      "_id": "stations.adapterStatus",
      "type": "state",
      "common": {
        "name": "adapter status",
        "desc": "adapter status",
        "type": "string",
        "role": "info.status",
        "def": "idle",
        "read": true,
        "write": false
      },
      "native": {}
    }
  ]
}
