{
  "APIKeyLink": "Sie erhalten den API Schlüssel auf der Seite",
  "Adapter Log Settings": "Adapter Log-Ausgabe Einstellungen",
  "Adapter Price Settings": "Einstellung der Adapterwerte",
  "No logs": "Log Ausgaben reduzieren",
  "No logs info": "Bei jeder Aktualisierung werden Log-Ausgaben geschrieben. ",
  "No logs info2": "Um die Zahl der Schreibzugriffe zu minimieren, kann hier durch einen Haken die Ausgabe reduziert werden.",
  "Reset values": "Setzen Sie die Werte vor jeder Synchronisierung zurück",
  "Reset values info": "Der Adapter setzt alle Preise vor jeder geplanten Aktualisierung zurück.",
  "Reset values info2": "Diese Funktion verhindert, dass veraltete Werte gespeichert werden, wenn beim Aktualisieren vom Tankerkönig-Server ein Fehler auftritt.",
  "Reset values info3": "Aktivieren Sie dieses Kontrollkästchen, um die Daten fließend zu halten und Nullen zu verhindern.",
  "StationName": "Name der Station",
  "add": "hinzufügen",
  "addNewStation ": "Neue Station hinzufügen ",
  "addStation": "Station hinzufügen",
  "cancel": "Abbrechen",
  "delete": "Löschen",
  "edit": "bearbeiten",
  "editModal": "Öffnet ein Fenster zum Bearbeiten einer Station.",
  "editStation": "Station bearbeiten",
  "good": "Akzeptiert",
  "helperText": "in Minuten (mindestens 5)",
  "interval": "Zeit zwischen den Abfragen",
  "intervalInfo": "Die Daten des Quellfeeds werden vom Server bei tankerkoenig.de nur alle 4 Minuten aktualisiert. Das kürzeste Abfrageintervall beträgt daher 5 Minuten, da eine häufigere Abfrage keinen Sinn macht.",
  "intervalInfo2": "Das kürzeste Abfrageintervall beträgt daher 5 Minuten, da eine häufigere Abfrage keinen Sinn macht.",
  "intervalTooltip": "Intervall für die Tankerkönig API Abfrage. Die Daten von Tankerkönig werden nur alle 4 min aktualisiert, somit ist das kleinste einstellbare Intervall 5 min.",
  "max10": "Maximale Anzahl an Stationen erreicht.",
  "settingsTab": "Adapter Einstellungen",
  "shell_city": "Stations Name z.B. SHELL",
  "spacerInterval": "Adapter Intervall",
  "stationFinder": "Tankstellenfinder",
  "station_id": "Station ID",
  "stationsTab": "Stationen",
  "tankerkoenig API": "Tankerkönig API-Schlüssel (36 Ziffern)",
  "tooltipAddStation": "Öffnet ein Fenster, um eine neue Station hinzuzufügen.",
  "tooltipApiKey": "Ein 36-stelliger API Key, den man auf der Seite tankerkoenig.de bekommen können",
  "tooltipStationID": "Stations ID kann man auf der Seite von tankerkoenig.de finden oder unten auf der Karte",
  "tooltipStationName": "Stationsname könnt ihr frei vergeben (MAX. 20 Zeichen). Empfohlen wird, den Namen der Tankstelle anzugeben, z.B. SHELL. Dieser Name wird bei den Datenpunkten als Name verwendet. ",
  "wrong": "Nicht richtig"
}