{
  "APIKeyLink": "Puede obtener la clave API en la página",
  "Adapter Log Settings": "Ajustes de la salida del registro del adaptador",
  "Adapter Price Settings": "Ajuste del valor del adaptador",
  "No logs": "Reducir los gastos de los troncos",
  "No logs info": "Las salidas de registro se escriben en cada actualización. ",
  "No logs info2": "Para minimizar el número de accesos de escritura, la salida puede reducirse aquí con una marca de verificación.",
  "Reset values": "Restablecer los valores antes de cada sincronización",
  "Reset values info": "El adaptador restablece todos los precios antes de cualquier actualización programada.",
  "Reset values info2": "Esta función evita que se guarden valores obsoletos si se produce un error al actualizar desde el servidor de Tanker King.",
  "Reset values info3": "Marque esta casilla para mantener los datos flotantes y evitar los ceros.",
  "StationName": "Nombre de la estación",
  "add": "añadir",
  "addNewStation ": "Añadir nueva estación ",
  "addStation": "añadir Estación",
  "cancel": "Cancelar",
  "delete": "Borrar",
  "edit": "editar",
  "editModal": "Abre uma janela para editar uma estação.",
  "editStation": "editar Estación",
  "good": "Aceptado",
  "helperText": "en minutos (al menos 5)",
  "interval": "Tiempo entre consultas",
  "intervalInfo": "Los datos de la fuente se actualizan en el servidor de tankerkoenig.de sólo cada 4 minutos. Por lo tanto, el intervalo de consulta más corto es de 5 minutos, ya que una consulta más frecuente no tiene sentido.",
  "intervalInfo2": "Por lo tanto, el intervalo de consulta más corto es de 5 minutos, ya que una consulta más frecuente no tiene sentido.",
  "intervalTooltip": "Intervalo para la consulta de la API de Tankerkönig. Los datos de Tankerkönig sólo se actualizan cada 4 minutos, por lo que el intervalo más pequeño que se puede establecer es de 5 minutos.",
  "max10": "Número máximo de estaciones alcanzadas.",
  "settingsTab": "Ajustes del adaptador",
  "shell_city": "Nombre de la estación, por ejemplo, SHELL",
  "spacerInterval": "Intervalo de adaptación",
  "stationFinder": "Buscador de gasolineras",
  "station_id": "Identificación de la estación",
  "stationsTab": "Estaciones",
  "tankerkoenig API": "clave API de tankerkoenig (36 dígitos)",
  "tooltipAddStation": "Abre una ventana para añadir una nueva estación.",
  "tooltipApiKey": "Una clave API de 36 dígitos, que puede obtenerse en el sitio web tankerkoenig.de.",
  "tooltipStationID": "La identificación de la estación se puede encontrar en la página de tankerkoenig.de o en la parte inferior del mapa.",
  "tooltipStationName": "Nombre de la estación que puede asignar libremente (MÁX. 20 caracteres). Se recomienda introducir el nombre de la estación de servicio, por ejemplo SHELL. Este nombre se utilizará como nombre para los puntos de datos. ",
  "wrong": "No está bien"
}