{
  "APIKeyLink": "Vous pouvez obtenir la clé API sur la page",
  "Adapter Log Settings": "Paramètres de sortie du journal de l'adaptateur",
  "Adapter Price Settings": "Réglage de la valeur de l'adaptateur",
  "No logs": "Réduire les dépenses liées aux grumes",
  "No logs info": "Les sorties du journal sont écrites à chaque mise à jour. ",
  "No logs info2": "Pour minimiser le nombre d'accès en écriture, la sortie peut être réduite ici par une coche.",
  "Reset values": "Remettre les valeurs à zéro avant chaque synchronisation",
  "Reset values info": "L'adaptateur réinitialise tous les prix avant toute mise à jour programmée.",
  "Reset values info2": "Cette fonction empêche la sauvegarde des valeurs périmées si une erreur se produit lors de la mise à jour depuis le serveur Tanker King.",
  "Reset values info3": "Cochez cette case pour garder les données flottantes et éviter les zéros.",
  "StationName": "Nom de la station",
  "add": "ajouter",
  "addNewStation ": "ajouter une nouvelle station ",
  "addStation": "ajouter une station",
  "cancel": "Annuler",
  "delete": "Supprimer",
  "edit": "modifier",
  "editModal": "Ouvre une fenêtre permettant de modifier une station.",
  "editStation": "station d'édition",
  "good": "Accepté",
  "helperText": "en minutes (au moins 5)",
  "interval": "Temps entre les requêtes",
  "intervalInfo": "Les données du flux source ne sont mises à jour par le serveur de tankerkoenig.de que toutes les 4 minutes. L'intervalle d'interrogation le plus court est donc de 5 minutes, car une interrogation plus fréquente n'a aucun sens.",
  "intervalInfo2": "Par conséquent, l'intervalle d'interrogation le plus court est de 5 minutes, car une interrogation plus fréquente n'a pas de sens.",
  "intervalTooltip": "Intervalle pour la requête API de Tankerkönig. Les données de Tankerkönig ne sont actualisées que toutes les 4 minutes, le plus petit intervalle réglable est donc de 5 minutes.",
  "max10": "Nombre maximum de stations atteintes.",
  "settingsTab": "Réglages de l'adaptateur",
  "shell_city": "Nom de la station, par exemple SHELL",
  "spacerInterval": "Intervalle d'adaptation",
  "stationFinder": "Recherche de stations-service",
  "station_id": "ID de la station",
  "stationsTab": "Stations",
  "tankerkoenig API": "tankerkoenig Clé API (36 chiffres)",
  "tooltipAddStation": "Ouvre une fenêtre pour ajouter une nouvelle station.",
  "tooltipApiKey": "Une clé API de 36 caractères, que l'on peut obtenir sur le site tankerkoenig.de",
  "tooltipStationID": "Vous pouvez trouver l'ID de la station sur le site tankerkoenig.de ou sur la carte ci-dessous.",
  "tooltipStationName": "Nom de la station que vous pouvez attribuer librement (MAX. 20 caractères). Il est recommandé d'entrer le nom de la station-service, par exemple SHELL. Ce nom sera utilisé comme nom pour les points de données. ",
  "wrong": "Pas correctement"
}