{
  "APIKeyLink": "È possibile ottenere la chiave API alla pagina",
  "Adapter Log Settings": "Impostazioni di uscita del registro dell'adattatore",
  "Adapter Price Settings": "Impostazione del valore dell'adattatore",
  "No logs": "Ridurre le spese per i registri",
  "No logs info": "Le uscite di registro vengono scritte a ogni aggiornamento. ",
  "No logs info2": "Per ridurre al minimo il numero di accessi in scrittura, l'uscita può essere ridotta con un segno di spunta.",
  "Reset values": "Azzeramento dei valori prima di ogni sincronizzazione",
  "Reset values info": "L'adattatore azzera tutti i prezzi prima di qualsiasi aggiornamento programmato.",
  "Reset values info2": "Questa funzione impedisce il salvataggio di valori non aggiornati se si verifica un errore durante l'aggiornamento dal server Tanker King.",
  "Reset values info3": "Selezionare questa casella per mantenere i dati fluttuanti ed evitare gli zeri.",
  "StationName": "Nome della stazione",
  "add": "aggiungere",
  "addNewStation ": "aggiungere una nuova stazione ",
  "addStation": "aggiungere Stazione",
  "cancel": "Annullamento",
  "delete": "Cancellare",
  "edit": "modifica",
  "editModal": "Apre una finestra per modificare una stazione.",
  "editStation": "modifica Stazione",
  "good": "Accettato",
  "helperText": "in minuti (almeno 5)",
  "interval": "Tempo tra le interrogazioni",
  "intervalInfo": "I dati del feed sorgente vengono aggiornati dal server di tankerkoenig.de solo ogni 4 minuti. L'intervallo di interrogazione più breve è quindi di 5 minuti, poiché un'interrogazione più frequente non ha senso.",
  "intervalInfo2": "Pertanto, l'intervallo di interrogazione più breve è di 5 minuti, poiché un'interrogazione più frequente non ha senso.",
  "intervalTooltip": "Intervallo per la query API Tankerkönig. I dati di Tankerkönig vengono aggiornati solo ogni 4 minuti, quindi l'intervallo minimo che può essere impostato è di 5 minuti.",
  "max10": "Numero massimo di stazioni raggiunte.",
  "settingsTab": "Impostazioni dell'adattatore",
  "shell_city": "Nome della stazione, ad esempio SHELL",
  "spacerInterval": "Intervallo adattatore",
  "stationFinder": "Trova distributore di benzina",
  "station_id": "ID stazione",
  "stationsTab": "Stazioni",
  "tankerkoenig API": "chiave API di tankerkoenig (36 cifre)",
  "tooltipAddStation": "Apre una finestra per aggiungere una nuova stazione.",
  "tooltipApiKey": "Una chiave API a 36 cifre, che può essere ottenuta dal sito web tankerkoenig.de.",
  "tooltipStationID": "L'ID della stazione si trova sulla pagina tankerkoenig.de o in fondo alla mappa.",
  "tooltipStationName": "Il nome della stazione può essere assegnato liberamente (MAX. 20 caratteri). Si consiglia di inserire il nome della stazione di servizio, ad esempio SHELL. Questo nome verrà utilizzato come nome per i punti dati. ",
  "wrong": "Non è giusto"
}